{"data":{"projectsJson":{"name":"A Learned Shape-Adaptive Subsurface Scattering Model","abstract":"Subsurface scattering, in which light refracts into a translucent material to interact with its interior, is the dominant mode of light transport in many types of organic materials. Accounting for this phenomenon is thus crucial for visual realism, but explicit simulation of the complex internal scattering process is often too costly. BSSRDF models based on analytic transport solutions are significantly more efficient but impose severe assumptions that are almost always violated, e.g. planar geometry, isotropy, low absorption, and spatio-directional separability. The resulting discrepancies between model and usage lead to objectionable errors in renderings, particularly near geometric features that violate planarity. This article introduces a new shape-adaptive BSSRDF model that retains the efficiency of prior analytic methods while greatly improving overall accuracy. Our approach is based on a conditional variational autoencoder, which learns to sample from a reference distribution produced by a brute-force volumetric path tracer. In contrast to the path tracer, our autoencoder directly samples outgoing locations on the object surface, bypassing a potentially lengthy internal scattering process. The distribution is conditional on both material properties and a set of features characterizing geometric variation in a neighborhood of the incident location. We use a low-order polynomial to model the local geometry as an implicitly defined surface, capturing curvature, thickness, corners, as well as cylindrical and toroidal regions. We present several examples of objects with challenging medium parameters and complex geometry and compare to ground truth simulations and prior work.","authors":[{"name":"Delio Vicini"},{"name":"Vladlen Koltun"},{"name":"Wenzel Jakob"}],"published":"ACM Transactions on Graphics (Proceedings of SIGGRAPH)","year":2019,"url":"learned-subsurface-scattering","supplemental":"https://rgl.s3.eu-central-1.amazonaws.com/media/papers/Vicini2019Learned.zip","video":null,"slides":null,"teaser":"teaser.png","teasercaption":"Rendering of translucent soap blocks with significant anisotropy (g=0.9). (a) Dipole diffusion-based models such as Photon Beam Diffusion [Habel et al. 2013] yield overall flat appearance due to their internal assumption of isotropy and plane-parallel light transport. (b) Our learned subsurface scattering model adapts to both geometry and anisotropy, producing more realistic appearance and lower error compared to a path-traced reference. Accounting for the geometry leads to increased scattering around the silhouette and overall higher contrast in regions with geometric detail. Our method has constant samplingweights, hence renderings converge with fewer samples. Please see the supplemental material for an interactive version of this figure including error maps.","pdf":"https://rgl.s3.eu-central-1.amazonaws.com/media/papers/Vicini2019Learned.pdf"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"learned-subsurface-scattering"}}